{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 Hi, I'm Utkarsh Nigam, a passionate and innovative software developer with over 4 years of experience in building scalable web and mobile applications. I specialize in backend development, cloud infrastructure, and creating seamless user experiences using technologies like Java, C#, Python, Spring, React, AWS, and Azure. Currently, I'm working at Microsoft in the Dataverse team for Dynamics 365 FnO, where I focus on data import/export systems and use automation and AI to reduce operational noise and improve SLA metrics. Previously, I was at Amazon, where I played a key role in designing and launching a notifications service used by clients to manage, schedule, and monitor messages with high reliability and usability. Beyond work, I enjoy exploring topics in machine learning, data science, and system design. I’m driven by curiosity and love mentoring others, solving complex problems, and contributing to impactful products.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "ProClip",
        "startDate": "2024",
        "description": "A clipboard manager that helps users to manage their clipboard data(text and images). It ensures that all copied information is securely stored for a period ranging from 30 to 90 days. This feature guarantees that users can access their clipboard history even after restarting their devices.ProClip offers a user-friendly interface with a chronological order of stored data, making it easy to track and retrieve past entries. Additionally, the integrated search bar allows users to quickly find specific items within their clipboard history, enhancing productivity and efficiency",
        "images": [
          "images/portfolio/proclip/p1.jpg",
          "images/portfolio/proclip/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-dot-net-plain",
            "name": ".Net"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Wavelet Trees",
        "startDate": "2020",
        "description": "Wavelet trees are used to separate sound frequencies by decomposing a signal into different frequency bands through a series of filters and decimation. Each node in the tree represents a specific frequency range, with low-frequency components typically on the lower branches and high-frequency components on the upper branches. This process allows for a detailed analysis of the signal's frequency content and its temporal location. We worked on parallelization of the whole process by distributing the subtree process to worker threads and applying optimal compression logic to solve the problem in optimal space and time.",
        "images": [
          "images/portfolio/wavelet/p3.jpg",
          "images/portfolio/wavelet/p4.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-java-original",
            "name": "Java"
          }
        ]
      },
      {
        "title": "Stochastic Gradient Descent",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Microsoft",
        "title": "Software Engineer II  (L62)",
        "years": "06.2024  - Present",
        "mainTech": [
          "Dataverse"
        ],
        "technologies": [
          ".NET",
          "Azure",
          "SSMS",
          "Batch Processing",
          "XPP",
          "WPF"
        ],
        "icon": "microsoft"
      },
      {
        "company": "Amazon",
        "title": "Software Developer Engineer II",
        "years": "07.2023 - 06.2024",
        "mainTech": [
          "Fintech"
        ],
        "technologies": [
          "Systems Design",
          "Instrumentation",
          "Spring",
          "AWS",
          "React"
        ],
        "icon": "amazon"
      },
      {
        "company": "Amazon",
        "title": "Software Developer Engineer",
        "years": "07.2021 - 07.2023",
        "mainTech": [
          "Fintech"
        ],
        "technologies": [
          "CDN",
          "API Gateway",
          "Elastic Search",
          "SNS",
          "SQS",
          "SES",
          "Lambda",
          "EC2",
          "Spring",
          "React"
        ],
        "icon": "amazon"
      },
      {
        "company": "Amazon",
        "title": "Software Developer Intern",
        "years": "01.2021 - 07.2021",
        "mainTech": [
          "Fintech"
        ],
        "technologies": [
          "Spring",
          "AWS",
          "JSP"
        ],
        "icon": "amazon"
      }
    ]
  }